{
  "id": "a5880eec-c46a-4cc9-acfc-328d120c9648",
  "name": "Get Record Data and Object Metadata",
  "url": "{{_endpoint}}/services/data/v{{version}}/ui-api/record-ui/<RECORD_IDS>",
  "description": "Get layout information, metadata, and data to build UI for a single record or for a collection of records.\nThe response contains layout information for whichever layout types are specified in the layoutTypes parameter.\n\nIt contains data for the records specified in the recordIds parameter.\n\nThe response contains object metadata for the object types of the records specified in the recordIds parameter, and for any nested objects. For example, a request to /ui-api/record-ui/001RM000003RsOHYA0, which is an Account, returns object metadata for Account and User, because the OwnerId field on the Account object contains a reference to the User object.",
  "data": null,
  "dataOptions": null,
  "dataMode": null,
  "headerData": [
    {
      "description": "",
      "enabled": true,
      "key": "Authorization",
      "type": "text",
      "value": "Bearer {{_accessToken}}"
    }
  ],
  "method": "GET",
  "pathVariableData": [],
  "queryParams": [
    {
      "key": "childRelationships",
      "value": "",
      "description": "A collection of child relationship names. The records with those child relationship names are included in the response. Specify names in the format ObjectApiName.ChildRelationshipName or ObjectApiName.ChildRelationshipName.FieldApiName. For example, to specify the Contacts relationship on an Account, use Account.Contacts. You can get child relationships one level deep.\nTo get a relationship name, look in the Object Info response body.\n",
      "enabled": false
    },
    {
      "key": "formFactor",
      "value": "",
      "description": "The layout display size for the record. One of these values:\nLarge—(Default) Use this value to get a layout for desktop display size.\nMedium—Use this value to get a layout for tablet display size.\nSmall—Use this value to get a layout for phone display size.",
      "enabled": false
    },
    {
      "key": "layoutTypes",
      "value": "",
      "description": "The layout type for the record. A collection of any of these values:\nCompact—Use this value to get a layout that contains a record’s key fields.\nFull—(Default) Use this value to get a full layout.",
      "enabled": false
    },
    {
      "key": "modes",
      "value": "",
      "description": "The access mode for the record. This value determines which fields to get from a layout. Layouts have different fields for create, edit, and view modes. For example, formula fields are rendered in view mode, but not in create mode because they’re calculated at run time, like formulas in a spreadsheet. A collection of any of these values:\nCreate—Use this mode if you intend to build UI that lets a user create a record. This mode is used by the /ui-api/record-defaults/create/<SOBJECT_API_NAME> resource.\nEdit—Use this mode if you intend to build UI that lets a user edit a record. This mode is used by the /ui-api/record-defaults/clone/<RECORD_ID> resource.\nView—(Default) Use this mode if you intend to build UI that displays a record.",
      "enabled": false
    },
    {
      "key": "optionalFields",
      "value": "",
      "description": "A collection of optional field names. If a field is accessible to the context user, it’s included in the response. If a field isn’t accessible to the context user, it isn’t included in the response, but it doesn’t cause an error.\nSpecify names in the format ObjectApiName.FieldName. You can get any field that has a named relationship to this record. There is no limit to the number of fields you can specify.",
      "enabled": false
    },
    {
      "key": "pageSize",
      "value": "",
      "description": "The maximum number of child records to return on a page.",
      "enabled": false
    },
    {
      "key": "updateMru",
      "value": "",
      "description": "To add to the most recently used (MRU) list view, set to true. The default value is false.",
      "enabled": false
    }
  ],
  "auth": null,
  "events": [],
  "folder": "4d16654a-9c96-4247-a5c8-ad85d4595c43",
  "currentHelper": null,
  "helperAttributes": null,
  "collectionId": "58651f2c-c011-41d0-b34b-b5609b7d95df",
  "headers": "Authorization: Bearer {{_accessToken}}\n",
  "pathVariables": {}
}