{
  "id": "7f354095-b02c-4bfc-b863-c1204a84fc4e",
  "name": "Get Record Layout Metadata",
  "url": "{{_endpoint}}/services/data/v{{version}}/ui-api/layout/<SOBJECT_API_NAME>",
  "description": "Get metadata about page layouts for the specified object type.",
  "data": null,
  "dataOptions": null,
  "dataMode": null,
  "headerData": [
    {
      "description": "",
      "enabled": true,
      "key": "Authorization",
      "type": "text",
      "value": "Bearer {{_accessToken}}"
    }
  ],
  "method": "GET",
  "pathVariableData": [],
  "queryParams": [
    {
      "key": "formFactor",
      "value": "",
      "description": "The layout display size for the record. One of these values:\nLarge—(Default) Use this value to get a layout for desktop display size.\nMedium—Use this value to get a layout for tablet display size.\nSmall—Use this value to get a layout for phone display size.",
      "enabled": false
    },
    {
      "key": "layoutTypes",
      "value": "",
      "description": "The layout type for the record. A collection of any of these values:\nCompact—Use this value to get a layout that contains a record’s key fields.\nFull—(Default) Use this value to get a full layout.",
      "enabled": false
    },
    {
      "key": "modes",
      "value": "",
      "description": "The access mode for the record. This value determines which fields to get from a layout. Layouts have different fields for create, edit, and view modes. For example, formula fields are rendered in view mode, but not in create mode because they’re calculated at run time, like formulas in a spreadsheet. A collection of any of these values:\nCreate—Use this mode if you intend to build UI that lets a user create a record. This mode is used by the /ui-api/record-defaults/create/<SOBJECT_API_NAME> resource.\nEdit—Use this mode if you intend to build UI that lets a user edit a record. This mode is used by the /ui-api/record-defaults/clone/<RECORD_ID> resource.\nView—(Default) Use this mode if you intend to build UI that displays a record.",
      "enabled": false
    },
    {
      "key": "recordTypeId",
      "value": "",
      "description": "The ID of the record type (RecordType object) for the new record. If not provided, the default record type is used.",
      "enabled": false
    }
  ],
  "auth": null,
  "events": [],
  "folder": "4d16654a-9c96-4247-a5c8-ad85d4595c43",
  "currentHelper": null,
  "helperAttributes": null,
  "collectionId": "58651f2c-c011-41d0-b34b-b5609b7d95df",
  "headers": "Authorization: Bearer {{_accessToken}}\n",
  "pathVariables": {}
}