{
  "id": "1c637a78-fa8b-4b37-8e4a-2862d8e6702e",
  "name": "Consent",
  "url": "{{_endpoint}}/services/data/v{{version}}/consent/action/action?actions&ids",
  "description": "Your users can store consent preferences in different locations and possibly inconsistently. You can locate your customers’ preferences for consent across multiple records when using API version 44.0 and later. Tracking consent preferences helps you and your users respect the most restrictive requests.\nConsent API aggregates consent settings across the Contact, Contact Point Type Consent, Data Use Purpose, Individual, Lead, Person Account, and User objects when the records have a lookup relationship. The Consent API can't locate records in which the email address field is protected by Platform Encryption.\n\nThe API returns consent details based on a single action, like email or track, or—starting with API version 45.0—the multiaction endpoint allows you to request multiple actions in a single API call.",
  "data": null,
  "dataOptions": null,
  "dataMode": null,
  "headerData": [
    {
      "key": "Authorization",
      "value": "Bearer {{_accessToken}}"
    },
    {
      "key": "Content-Type",
      "value": "application/json"
    }
  ],
  "method": "GET",
  "pathVariableData": [],
  "queryParams": [
    {
      "key": "actions",
      "value": "",
      "description": "Comma-separated list of proposed actions. This required parameter applies only to the multiaction endpoint.\nThis parameter is available in API version 45.0 and later.\n\nIf this is used, action cannot be used.",
      "enabled": true
    },
    {
      "key": "aggregatedConsent",
      "value": "",
      "description": "Optional: true or false. aggregatedConsent is the same as aggregatedConsent=true. If true, one result is returned indicating whether to proceed or not, rather than a result for each ID. If any ID in the list returns false, the aggregated result is false.",
      "enabled": false
    },
    {
      "key": "datetime",
      "value": "",
      "description": "Optional. The timestamp for which consent is determined. The value is converted to the UTC timezone and must be specified in ISO 8601 format. If not specified, defaults to the current date and time.",
      "enabled": false
    },
    {
      "key": "ids",
      "value": "",
      "description": "Required. Comma-separated list of IDs. The ID can be the record ID or the email address listed on the record.",
      "enabled": true
    },
    {
      "key": "purpose",
      "value": "",
      "description": "Optional. The reason for contacting a customer.",
      "enabled": false
    },
    {
      "key": "verbose",
      "value": "",
      "description": "Optional: true or false. verbose is the same as verbose=true. Verbose responses are slower than non-verbose responses. See the examples for a verbose response.",
      "enabled": false
    }
  ],
  "auth": null,
  "events": null,
  "folder": "7e4757ad-56f4-43ad-8175-051e53410941",
  "currentHelper": null,
  "helperAttributes": null,
  "collectionId": "58651f2c-c011-41d0-b34b-b5609b7d95df",
  "headers": "Authorization: Bearer {{_accessToken}}\nContent-Type: application/json\n",
  "pathVariables": {}
}