{
  "id": "36191110-96b8-449e-b7c1-879603021c7a",
  "name": "QueryAll",
  "url": "{{_endpoint}}/services/data/v{{version}}/sobjects/OpportunityLineItem/<OpportunityLineItemId>/OpportunityLineItemSchedules?q",
  "description": "Executes the specified SOQL query. Unlike the Query resource, QueryAll will return records that have been deleted because of a merge or delete. QueryAll will also return information about archived Task and Event records. QueryAll is available in API version 29.0 and later.\n\nIf the query results are too large, the response contains the first batch of results and a query identifier in the nextRecordsUrl field of the response. The identifier can be used in an additional request to retrieve the next batch. Note that even though nextRecordsUrl has query in the URL, it will still provide remaining results from the initial QueryAll request. The remaining results will include deleted records that matched the initial query.\nhttps://developer.salesforce.com/docs/atlas.en-us.api_rest.meta/api_rest/resources_queryall.htm",
  "data": null,
  "dataOptions": null,
  "dataMode": null,
  "headerData": [
    {
      "key": "Authorization",
      "value": "Bearer {{_accessToken}}"
    },
    {
      "key": "Content-Type",
      "value": "application/json"
    }
  ],
  "method": "GET",
  "pathVariableData": [],
  "queryParams": [
    {
      "key": "q",
      "value": "",
      "equals": false,
      "description": "A SOQL query. Note that you will need to replace spaces with “+” characters in your query string to create a valid URI. An example query parameter string might look like: “SELECT+Name+FROM+MyObject”. If the SOQL query string is invalid, a MALFORMED_QUERY response is returned.",
      "enabled": true
    },
    {
      "key": "explain",
      "value": "",
      "description": "A SOQL query to get performance feedback on. Use explain instead of q to get a response that details how Salesforce will process your query. You can use this feedback to further optimize your queries. You can also use a report or list view ID in place of the query string to get feedback on how Salesforce will process your report or list view.",
      "enabled": false
    }
  ],
  "auth": null,
  "events": null,
  "folder": "0d3ee9a8-caca-4178-8113-2b29bde30bc2",
  "currentHelper": null,
  "helperAttributes": null,
  "collectionId": "dcabe06e-5abb-4b30-9188-64ecc63d6edc",
  "headers": "Authorization: Bearer {{_accessToken}}\nContent-Type: application/json\n",
  "pathVariables": {}
}