{
  "id": "bee10cb9-408f-460b-b530-636c50889ed4",
  "name": "Relevant Items",
  "url": "{{_endpoint}}/services/data/v{{version}}/sobjects/relevantItems",
  "description": "Gets the current user’s most relevant items. Relevant items include records for objects in the user’s global search scope and also most recently used (MRU) objects.\nRelevant items include up to 50 of the most recently viewed or updated records for each object in the user’s global search scope.\nNote\nThe user’s global search scope includes the objects the user interacted with most in the last 30 days, including objects the user pinned from the search results page in the Salesforce Classic.\n\nThen, the resource finds more recent records for each most recently used (MRU) object until the maximum number of records, which is 2,000, is returned.\nThis resource only accesses the relevant item information. Modifying the list of relevant items is not currently supported\nhttps://developer.salesforce.com/docs/atlas.en-us.api_rest.meta/api_rest/resources_relevant_items.htm",
  "data": null,
  "dataOptions": null,
  "dataMode": null,
  "headerData": [
    {
      "key": "Authorization",
      "value": "Bearer {{_accessToken}}"
    },
    {
      "key": "Content-Type",
      "value": "application/json"
    }
  ],
  "method": "GET",
  "pathVariableData": [],
  "queryParams": [
    {
      "key": "lastUpdatedId",
      "value": "",
      "description": "Optional. Compares the entire current list of relevant items to a previous version, if available. Specify the lastUpdatedId value returned in a previous response.",
      "enabled": false
    },
    {
      "key": "sobjects",
      "value": "",
      "description": "Optional. To scope the results to a particular object or set of objects, specify the name for one or more sObjects.",
      "enabled": false
    },
    {
      "key": "sobject.lastUpdatedId",
      "value": "",
      "description": "Optional. Compares the current list of relevant items for this particular object to a previous version, if available. Specify the lastUpdatedId value returned in a previous response.\nNote\nYou can only specify this parameter for the sObjects specified in the sobjects parameter.",
      "enabled": false
    }
  ],
  "auth": null,
  "events": null,
  "folder": "6d380c8e-3b9c-4de8-9df0-c8c9b528503c",
  "currentHelper": null,
  "helperAttributes": null,
  "collectionId": "ef6270a2-204a-4f44-ad82-a606c1d1ad3e",
  "headers": "Authorization: Bearer {{_accessToken}}\nContent-Type: application/json\n",
  "pathVariables": {}
}
